### 결측치 다루기

dropna()
- NA / null 값이 존재 시, 제거(Drop)
- axis=0 : 행, axis=1 : 열
- how='all', how='any'


fillna()
- NA / null 값을 대체


isnull() / notnull
- isnull().sum() : 결측치가 몇 개인지 확인
    - 대량의 데이터 분석 시 유용함

### Handling_Missing_Data

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([])
df

Empty DataFrame
Columns: []
Index: []

### dropna()

In [4]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3, 4, np.nan, 1],
                  [np.nan, np.nan, np.nan, 5]],
                 columns = list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [5]:
df.dropna(axis=0, how='all')  
# axis=0: 행, axis=1: 열, how='all': 전부 다 null 값이 있으면 drop시킴

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [6]:
df.dropna(axis=1, how='all')

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [7]:
df.dropna(axis=0, how='any')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [9]:
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

### fillna()

In [11]:
df.fillna(0)   # null 값을 0으로 채움

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [15]:
values = {'A':0, 'B':1, 'C':2, 'D':3}
df.fillna(value=values)

# NULL값을 A는 0, B는 1, C는 2, D는 3의 값으로 채움

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [16]:
df['A'].mean()

3.0

In [17]:
df['D'].mean()

2.0

In [19]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [18]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [21]:
fill_na_value = df['D'].max()
fill_na_value

5

In [22]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [23]:
df.isnull()  # boolean 으로 나옴

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [24]:
df.isnull().sum()   # 결측치가 몇 개인지 확인

A    2
B    1
C    3
D    0
dtype: int64

In [25]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64